Revit 2027 API
FailureMessageAccessor.GetFailingElementIds Method
 Retrieves Ids of Elements that have caused the failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetFailingElementIds()
Public Function GetFailingElementIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetFailingElementIds()
member GetFailingElementIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 Ids of Elements that have caused the failure.
Exceptions
Exception | Condition
InvalidOperationException |  This FailureMessageAccessor has not been properly initialized.
See Also
Reference
FailureMessageAccessor Class
Autodesk.Revit.DB Namespace